/*利用if语句组个进行比较

*/
#include<stdio.h>
int main()
{
    int a[3],b[3],i;
    for(i=0;i<3;i++)
        scanf("%d",&a[i]);
    if(a[0]>a[1]&&a[0]>a[2])
        b[0]=a[0];
    if(a[1]>a[0]&&a[1]>a[2])
        b[0]=a[1];
    if(a[2]>a[0]&&a[2]>a[1])
        b[0]=a[2];
    if(a[0]<a[1]&&a[0]<a[2])
        b[2]=a[0];
    if(a[1]<a[0]&&a[1]<a[2])
        b[2]=a[1];
    if(a[2]<a[0]&&a[2]<a[1])
        b[2]=a[2];
    if(a[0]>a[1]&&a[0]<a[2])
        b[1]=a[0];
    if(a[1]>a[0]&&a[1]<a[2])
        b[1]=a[1];
    if(a[2]>a[0]&&a[2]<a[1])
        b[1]=a[2];
        for(i=0;i<3;i++)
        printf("%d ",b[i]);
}
